src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиДенег</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДоходовоИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслугТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК Количество,
	|	МАКСИМУМ(РеализацияТоваровИУслугТовары.Цена) КАК Цена,
	|	СУММА(РеализацияТоваровИУслугТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	|ГДЕ
	|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.Остатки(
	|			&ДатаОстатков,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ_Товары.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ВТ_Товары КАК ВТ_Товары)) КАК ОстаткиТоваровОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.Сумма КАК Сумма,
	|	ВТ_Остатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_Остатки.КоличествоОстаток - ВТ_Товары.Количество КАК Дефицит,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Товары.Номенклатура) КАК НоменклатураПредставление
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Товары.Номенклатура = ВТ_Остатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаОстатков", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Дефицит < 0 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не хватает товара ""%1"" в кол-ве %2 ед., всего товара на складе - %3 ед.", 
										Выборка.НоменклатураПредставление, -Выборка.Дефицит, Выборка.КоличествоОстаток);
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		//Движение = Движения.ОстаткиТоваров.Добавить();
		//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//Движение.Период = Дата;
		//Движение.Номенклатура = Выборка.Номенклатура;
		//Движение.Количество = Выборка.Количество;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Цена = Выборка.Цена;
		
	КонецЦикла;
	
	//Движения.ОстаткиТоваров.Записывать = Истина;
	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПРЕДСТАВЛЕНИЕ(ОстаткиТоваровОстатки.Номенклатура) КАК Товар,
	//	|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Остаток
	//	|ИЗ
	//	|	РегистрНакопления.ОстаткиТоваров.Остатки(
	//	|			&МоментВремени,
	//	|			Номенклатура В
	//	|				(ВЫБРАТЬ
	//	|					ВТ_Товары.Номенклатура КАК Номенклатура
	//	|				ИЗ
	//	|					ВТ_Товары КАК ВТ_Товары)) КАК ОстаткиТоваровОстатки
	//	|ГДЕ
	//	|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	//
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	Отказ = Истина;
	//
	//	Выборка = РезультатЗапроса.Выбрать();
	//
	//	Пока Выборка.Следующий() Цикл
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = СтрШаблон("Не хватает товара: ""%1"" в количестве %2 ед.", Выборка.Товар, -Выборка.Остаток);
	//		Сообщение.Сообщить();
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
		
КонецПроцедуры
